"""
قیمت لپتاپ ها

یه روز سیندخت و ایرسا در حال بحث در مورد قیمت لپتاپ ها و کیفیت آنها بودند.
سیندخت حدس میزنه هرچی یه لپتاپ گرونتر باشه کیفیت بهتری هم داره. اما
ایرسا ادعا میکنه میتونه 2 تا لپتاپ پیدا کنه که قیمت اولی از دومی کمتر باشه
ولی کیفیتش از دومی بیشتر باشه و بتونه حدس سیندخت رو رد کنه. حالا شما باید با
نوشتن یه برنامه به ایرسا کمک کنید ادعای خودش رو بررسی کنه.
هست که تعداد n لپتاپ به شما داده میشه. خط اول ورودی شامل عدد n مشخصات
خط بعدی شامل دو عدد می باشد که عدد n لپتاپ ها را نشان میدهد. هر یک از
اول قیمت لپتاپ را نشان می دهد و عدد دوم کیفیت آن لپتاپ را. اگه تونستید دو تا
happy irsa لپتاپ پیدا کنید که شرایط گفته شده توسط ایرسا را داشته باشد چاپ کنید 
لطفا به کوچک بودن حروف توجه کنید poor irsa در غیر اینصورت چاپ کنید
تمامی حروف به صورت کوچک نوشته می شوند.

ورودی نمونه اول: 
2
1 10
7 3

خروجی نمونه اول: 
happy irsa

در ورودی نمونه لپتاپ اول قیمت 1 را دارد و کیفیت 10
(هرچه عدد بزرگتر باشد کیفیت بیشتر است)
لپتاپ دوم قیمت 7 را دارد و کیفیت 3. خب ایرسا موفق شده است دو لپتاپ پیدا کند که با
اینکه قیمت دومی از قیمت اولی بیشتر است، اما کیفیت دومی از اولی کمتر است

ورودی نمونه دوم:
4
1 5
7 9
5 6
20 30

خروجی نمونه دوم: 
poor irsa
"""

def status(arr):
    status = "poor"
    for i in arr:
        for j in arr:
            if i[0] < j[0] and i[1] > j[1]:
                status = "happy"
                return status
    return status

num_of_laptops = int(input("Enter the number of laptops: "))

list_of_laptops = []
for _ in range(num_of_laptops):
    laptop = input()
    list_of_laptops.append([int(x) for x in laptop.split(" ")])

print(status(list_of_laptops) + " irsa")
