"""
مسابقات جهانی کبدی

مسئولین فدراسیون کبدی کشور درحال آماده سازی تیم هایی برای شرکت در
مسابقات جهانی کبدی هستند.طبق قوانین مسابقات جهانی کبدی هر شخص فقط در 5
مسابقه ی جهانی کبدی میتواند شرکت کند. رئیس فدراسیون تمامی ورزشکاران
این رشته را دور هم جمع کرده است، هر بازیکن تا امروز تعدادی بار در مسابقات جهانی
شرکت کرده است. تیم های کبدی دقیقا از ۳ نفر تشکیل میشود. حال آقای شایگان
آریامهر، رئیس فدراسیون میخواهد تیم هایی تشکیل دهد که در صورت انتخاب شدن
هرکدام از آن تیم ها، حداقل بتوانند 3 سال باهم در مسابقات جهانی شرکت کنند
(یعنی هرکدام از اعضای یک تیم حداکثر ۲ بار در مسابقات جهانی شرکت کرده باشند)

یعنی تعداد بازیکنان کبدی مدنظراست. خط بعدی ورودی n خط اول ورودی شامل عدد
از هم جدا شده اند می باشد که نمایانگر این است که هر space عدد که با n شامل
بازیکن چند بار در مسابقات جهانی شرکت کرده است. در خروجی یک عدد چاپ کنید که
نمایانگر حداکثر تیم های تشکیل شده با شرایط گفته شده می باشد.

ورودی نمونه: 
6
5 0 4 2 1 0

خروجی نمونه: 
1

در ورودی نمونه داده شده، بازیکنانی که 5 و 4 بازی داشته اند، طبق صورت سوال
نمی توانند در گروهی باشند. بنابراین فقط 4 بازیکنی که 0 و 2 و 1 و 0 بازی داشته اند
می توانند در گروه ها باشند. با 4 نفر هم تنها میتوان 1 گروه 3 نفره تشکیل داد. دقت کنید که
لازم نیست تعداد حالت یا جایگشت ها را حساب کنید. 
"""

# No need to get the first input
num_of_games = input("Enter the number of each player's games, separated with spaces: ")
list_of_games = [int(x) for x in num_of_games.split(" ") if int(x) <= 2]
print(len(list_of_games) // 3)
