"""
فوتبال

برنامه ای بنویسید که در آن یک کلاس فوتبالیست وجود دارد که از کلاس انسان ویژگی هایی را به ارث می برد.
برنامه به اینگونه است که در ابتدا 22 شی فوتبالیست نیاز است ایجاد کنید، سپس اسامی بازیکنان زیر را به
تقسیم کنید و B و A هر شی اختصاص دهید. با استفاده از متد رندم و ارث بری، این 22 تا نام را بین دو تیم
در نهایت اسم هر بازیکن با نام تیمی که در آن قرار دارد را چاپ کنید.
اسامی بازیکنان:
hosein - mazyar - akbar - nima - mahdi - farhad - mohammad - khashayar - milad - mostafa - amin - saeed - 
pouya - pourya - reza - ali - behzad - soheil - behrooz - shahrooz - saman - mohsen
"""

