"""
سیستم شمارش آرا

آقای ژوبین آرتاباز رییس سازمان ملل متحد هست و قراره راجع به انتخاب هیئت رئیسه
یک رای گیری انجام بده! دادمهر جمشیدی که مسئول کامپیوتر سازمان ملل هست
برنامه ای نوشته که می شمره هر کشور چند رای رو کسب کرده. شما قراره با نوشتن
برنامه ای به دادمهر کمک کنید تا آرا رو شمارش کنه.
خط n هست که تعداد کل آرا رو نمانش میده. هر یک از n خط اول ورودی شامل عدد
بعدی شامل اسم یک کشور می باشد. اسم کشورها از حروف کوچک انگلیسی ساخته
شده اند.
خط چاپ کنید که شامل تعداد آرا هر یک از کشورها می باشد. نام m در خروجی
کشورها را به ترتیب حروف الفبا در خروجی بنویسید. برای اطلاعات بیشتر به ورودی نمونه و
خروجی نمونه توجه کنید.

ورودی نمونه:
5
usa
uk
iran
usa
usa

خروجی نمونه: 
iran: 1
uk: 1
usa: 3
"""

